Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичнаяВстреча</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтовоеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВходящееИсходящееСобытие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВходящееИсходящееСобытие</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/Э_ТелефонияBinotelКлиент/Ext/Module.bsl
// Обработчик события ПриНачалеРаботыСистемы вызывается
// для выполнения действий, требуемых для подсистемы ОткрытиеФормПриНачалеРаботыСистемы.
//
Процедура ОткрытиеФормПриНачалеРаботыСистемы() Экспорт
	ОткрытьФорму("Обработка.Э_BinotelPhone.Форма.ТелефонУправляемая",,, "Phone");
	
КонецПроцедуры

// Процедура вызывается из карточек тех объектов, у которых необходимо набрать номер
//
Процедура НабратьНомерКИ(ТекущаяСтрока, ИмяПоля="") Экспорт
		
	Если НЕ ЗначениеЗаполнено(ИмяПоля) Тогда
		ИмяПоля = "CRM_НомерТелефона";
	КонецЕсли;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		Если ТекущаяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			НомерАбонента = СокрЛП(ТекущаяСтрока[ИмяПоля]);
			Если НЕ ЗначениеЗаполнено(НомерАбонента) Тогда
				НомерАбонента = Э_ТелефонияBinotel.Э_ПреобразоватьНомерТелефонаБезРазделителей(ТекущаяСтрока.Представление);
			Иначе
				НомерАбонента = Э_ТелефонияBinotel.Э_ПреобразоватьНомерТелефонаБезРазделителей(НомерАбонента);
			КонецЕсли;	
			
			НабратьНомер(НомерАбонента);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НабратьНомер(НомерАбонента) Экспорт
	Перем ФормаТелефон;
	
	ФормаТелефон = Э_BinotelPhone.ПолучитьФорму("Телефон");
	ФормаТелефон.Активизировать();
	Если НЕ ФормаТелефон.Открыта() Тогда
		ФормаТелефон.Открыть();
	КонецЕсли;
	ФормаТелефон.PhoneNumber = НомерАбонента;
	ФормаТелефон.Э_Позвонить();
КонецПроцедуры
 
Процедура Э_ОткрытьПанельБинотел(Э_BinotelPhone,ВыдаватьПредпреждение=Ложь) Экспорт
	Если РольДоступна("Э_BinotelПользователь") Тогда
		Если не ТипЗнч(Э_BinotelPhone)=Тип("ОбработкаМенеджер.Э_BinotelPhone") Тогда
		    Э_BinotelPhone=Обработки.Э_BinotelPhone;
		КонецЕсли;
		ФормаТелефонBinotel = Э_BinotelPhone.ПолучитьФорму("Телефон");
		Если НЕ ФормаТелефонBinotel.Открыта() Тогда
			ФормаТелефонBinotel.Открыть();
		иначе
		    ФормаТелефонBinotel.Активизировать();
			ФормаТелефонBinotel.КомандаЗвонкиОнлайн();
		КонецЕсли;
	иначе
		Если ВыдаватьПредпреждение Тогда
		     Сообщить(НСтр("ru='Для данного пользователя не доступна роль ""Binotel:Пользователь""';uk='Для цього користувача не доступна роль ""Binotel:Користувач""'")); 
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры
 
Процедура Э_BinotelПользовательДействие() Экспорт
    Э_ОткрытьПанельБинотел(Э_BinotelPhone,Истина);
КонецПроцедуры
 
Процедура Э_СписокАбонентовПозвонить(ТекКонтрагентСсылка) Экспорт
	Если не ЗначениеЗаполнено(ТекКонтрагентСсылка) Тогда
		Сообщить(НСтр("ru='Пустая ссылка на элемент справочника ""Контрагенты"". Возможно, элемент не записан.';uk='Порожнє посилання на елемент довідника ""Контрагенти"". Можливо, елемент не записаний.'"));     
		Возврат;	
	КонецЕсли; 
	
	ФормаАбоненты	 			=	ПолучитьОбщуюФорму("Э_ТелефонияСписокАбонентовПозвонить",,ТекКонтрагентСсылка); 	
	ФормаАбоненты.Контрагент	= 	ТекКонтрагентСсылка;
	ФормаАбоненты.Открыть();
КонецПроцедуры

Функция Э_ПозвонитьНаБинотел(СтатусЗвонка,PhoneNumber) Экспорт
	Перем Э_BinotelPhoneLoc;
	
	
	НомерТелефонаДляБинотел=Э_ТелефонияBinotel.Э_ПреобразоватьНомерТелефонаБезРазделителей(PhoneNumber);
	Э_BinotelPhoneLoc = Обработки.Э_BinotelPhone.Создать();
	generalCallID = Э_BinotelPhoneLoc.НабратьНомер(НомерТелефонаДляБинотел); 
	Если ЗначениеЗаполнено(generalCallID) Тогда 
		ВремяНачалаЗвонка = ТекущаяДата();
		СтатусЗвонка = Э_СтатусЗвонка(generalCallID);
	Иначе	
		СтатусЗвонка = Неопределено;
	КонецЕсли;
	Возврат generalCallID;
КонецФункции

Функция Э_СтатусЗвонка(generalCallID) Экспорт
	СтатусЗвонка = "";
	
	Если ЗначениеЗаполнено(generalCallID) Тогда
		result_details = Э_ТелефонияBinotel.sendRequest("stats/call-details", Новый Структура("generalCallID",generalCallID));
		СтруктураРезультат = Э_РаботаСJSON.Э_ПрочитатьJSON(result_details);
		Если ТипЗнч(СтруктураРезультат) = Тип("Структура") Тогда
			Если Найти(СтруктураРезультат["status"], "success") > 0 Тогда
				callDetails = СтруктураРезультат.callDetails.Получить(generalCallID);
				Если НЕ callDetails = Неопределено Тогда
					Если Найти(callDetails.disposition, "ONLINE") > 0 Тогда
						СтатусЗвонка = "ONLINE";
					ИначеЕсли callDetails.disposition <> "" Тогда
						СтатусЗвонка = "COMPLETED";
					КонецЕсли;	
				КонецЕсли;	
			Иначе	
				СтатусЗвонка = "not_success";
			КонецЕсли;
		Иначе
			СтатусЗвонка = "error";
		КонецЕсли;	
	КонецЕсли;	
	
	Если СтатусЗвонка <> "ONLINE" Тогда
		generalCallID = "";
		ВремяНачалаЗвонка = Дата(1,1,1); 
	КонецЕсли;	
	
	Возврат СтатусЗвонка;
КонецФункции	
 
Процедура ОтборВФормеСписка_ПредложитьСнятьИерархическийПросмотр(ТабличноеПолеПоиска,СпрашиватьСниматьЛиИерархическийПросмотр=Истина) Экспорт
	Если ТабличноеПолеПоиска.ИерархическийПросмотр Тогда
		Если СпрашиватьСниматьЛиИерархическийПросмотр=Неопределено или СпрашиватьСниматьЛиИерархическийПросмотр Тогда
		    ОтветНаВопрос = Вопрос("Для удобства поиска рекомендуется снять режим иерархического просмотра. Снять?", РежимДиалогаВопрос.ДаНет);
			Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
				ТабличноеПолеПоиска.ИерархическийПросмотр = Ложь;
			КонецЕсли; 
		иначе
			ТабличноеПолеПоиска.ИерархическийПросмотр = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


// Функция Определяет индекс картинки
//
// Параметры
//  ВидСобытия - ПеречислениеСсылка.ВидыСобытий
//  ТипСобытия - ПеречислениеСсылка.ВходящееИсходящееСобытие
//
// Возвращаемое значение:
//  Индекс - число
//
Функция ОпределитьИндексКартинкиВидаСобытия(Объект,ТипСобытия = Неопределено) Экспорт

	Если ТипЗнч(Объект) = Тип("ДокументСсылка.Событие") Тогда
		ВидСобытия = Объект.ВидСобытия;
		ТипСобытия = Объект.ТипСобытия;
	Иначе
		ВидСобытия = Объект;
	КонецЕсли;
	
	Если ТипЗнч(ВидСобытия) = Тип("ПеречислениеСсылка.ВидыСобытий") Тогда
		
		Если ВидСобытия = Перечисления.ВидыСобытий.ТелефонныйЗвонок Тогда
			Если ТипСобытия = Перечисления.ВходящееИсходящееСобытие.Исходящее Тогда
				Возврат 14;
			Иначе
				Возврат 9;
			КонецЕсли;
		ИначеЕсли ВидСобытия = Перечисления.ВидыСобытий.ЛичнаяВстреча Тогда
			Если ТипСобытия = Перечисления.ВходящееИсходящееСобытие.Исходящее Тогда
				Возврат 15;
			Иначе
				Возврат 10;
			КонецЕсли;
		ИначеЕсли ВидСобытия = Перечисления.ВидыСобытий.ЭлектронноеПисьмо Тогда
			Если ТипСобытия = Перечисления.ВходящееИсходящееСобытие.Исходящее Тогда
				Возврат 16;
			Иначе
				Возврат 11;
			КонецЕсли;
		ИначеЕсли ВидСобытия = Перечисления.ВидыСобытий.ПочтовоеПисьмо Тогда
			Если ТипСобытия = Перечисления.ВходящееИсходящееСобытие.Исходящее Тогда
				Возврат 17;
			Иначе
				Возврат 12;
			КонецЕсли;
		Иначе
			Если ТипСобытия = Перечисления.ВходящееИсходящееСобытие.Исходящее Тогда
				Возврат 13;
			Иначе
				Возврат 8;
			КонецЕсли;
		КонецЕсли;
			
	Иначе
		Возврат 21;
	КонецЕсли;

КонецФункции // ОпределитьИндексКартинкиВидаСобытия()

//Э_Волощук (06.07.2019 17:20:07
////Э_Волощук (13.05.2019 16:38:57
//Процедура Э_СоздатьНовыйЗаказПокупателя(ПараметрыЗвонка, ОткрыватьЖурналЗаказовПоКлиентуПриСозданииЗаказаПокупателя = Ложь) Экспорт
Процедура Э_СоздатьНовыйЗаказПокупателя(ПараметрыЗвонка) Экспорт
//Э_Волощук)
	Если ПараметрыЗвонка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовыйЗаказ = Документы.ЗаказПокупателя.СоздатьДокумент();
	Если ТипЗнч(ПараметрыЗвонка)=Тип("Структура") и ПараметрыЗвонка.Свойство("Контрагент") и ЗначениеЗаполнено(ПараметрыЗвонка.Контрагент) Тогда
		НовыйЗаказ.Контрагент = ПараметрыЗвонка.Контрагент;
	КонецЕсли;	
	Если ТипЗнч(ПараметрыЗвонка)=Тип("Структура") и ПараметрыЗвонка.Свойство("КонтактноеЛицо") и ЗначениеЗаполнено(ПараметрыЗвонка.КонтактноеЛицо) Тогда
		НовыйЗаказ.КонтактноеЛицоКонтрагента = ПараметрыЗвонка.КонтактноеЛицо;
	КонецЕсли;
	Если ТипЗнч(ПараметрыЗвонка)=Тип("Структура") и ПараметрыЗвонка.Свойство("Э_Лид") и ЗначениеЗаполнено(ПараметрыЗвонка.Э_Лид) Тогда
		НовыйЗаказ.Э_Лид = ПараметрыЗвонка.Э_Лид;
	КонецЕсли;	
	
	//Э_Волощук (06.07.2019 17:20:42
	//Если ОткрыватьЖурналЗаказовПоКлиентуПриСозданииЗаказаПокупателя Тогда
	//	ФормаСписокЗаказов = Документы.ЗаказПокупателя.ПолучитьФормуСписка();
	//	ФормаСписокЗаказов.Отбор.Контрагент.Установить(НовыйЗаказ.Контрагент, Истина);
	//	ФормаСписокЗаказов.Открыть();
	//КонецЕсли;
	//Э_Волощук)
	
	НовыйЗаказ = НовыйЗаказ.ПолучитьФорму("ФормаДокумента",);
    НовыйЗаказ.Открыть();
КонецПроцедуры
//Э_Волощук)

//Э_Волощук (06.07.2019 17:16:03
Процедура Э_ОткыватьСписокЗаказовКлиента(ПараметрыЗвонка, ОткрыватьЖурналЗаказовПоКлиенту = Ложь) Экспорт
	Если ПараметрыЗвонка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контрагент = Неопределено;
	Если ТипЗнч(ПараметрыЗвонка)=Тип("Структура") И ПараметрыЗвонка.Свойство("Контрагент", Контрагент) и ЗначениеЗаполнено(Контрагент) И ОткрыватьЖурналЗаказовПоКлиенту Тогда
		ФормаСписокЗаказов = Документы.ЗаказПокупателя.ПолучитьФормуСписка();
		ФормаСписокЗаказов.Отбор.Контрагент.Установить(Контрагент, Истина);
		ФормаСписокЗаказов.Открыть();
	КонецЕсли;
	
КонецПроцедуры
//Э_Волощук)
